app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(comment_params)
    	@new.comments << @comment
---
INSERT INTO "comments" ("author", "comment", "created_at", "updated_at", "new_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Juan Pérez"], ["comment", "Que buena noticia!"], ["created_at", "2018-04-03 19:24:54.283961"], ["updated_at", "2018-04-03 19:24:54.283961"], ["new_id", 1]]

	def destroy_comment
		if @new.id == @comment.new_id
			if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]

	def update_comment
		if @new.id == @comment.new_id
			if @comment.update(comment_params)
---
UPDATE "comments" SET "comment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment", "No esta tan buena"], ["updated_at", "2018-04-03 19:27:54.147122"], ["id", 1]]

	def set_new
		@new = New.find(params[:new_id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]