app/controllers/news_controller.rb

SELECT "news".* FROM "news"
---
	def index
      render json: New.all

INSERT INTO "news" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
      @new = New.new(new_params)
      if @new.save

DELETE FROM "news" WHERE "news"."id" = $1  [["id", 2]]
---
    def destroy
		if @new.destroy

UPDATE "news" SET "title" = $1, "body" = $2, "subtitle" = $3, "updated_at" = $4 WHERE "news"."id" = $5  [["title", "pelo"], ["body", "un pelo peliado"], ["subtitle", "subpelo"], ["updated_at", "2018-04-03 19:23:35.286277"], ["id", 1]]
---
	def update
    	if @new.update(new_params)

SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_new
    @new = New.find(params[:id])